"""
Базовые переменные:

Создайте переменные для следующих данных:
Ваш любимый цвет (строка).
Количество часов сна, которое вы обычно получаете за ночь (вещественное число).
Количество книг, которые вы прочитали за последний месяц (целое число).
Выведите информацию о ваших переменных, используя форматированный вывод.
"""
favorite_color = "Синий"
Number_hours_sleep = 8.5
Number_books = 5
print(f"Мой любимый цвет: {favorite_color},Количество часов сна: {Number_hours_sleep},"
      f" Количество книг прочитанных за месяц: {Number_books} штук.")