"""Ввод-вывод
Попросите пользователя ввести своё имя и возраст.
Выведите приветственное сообщение, включая имя и возраст.
"""

name = input("Введите ваше имя: ")
age = int(input("Введите ваш возраст: "))
print("Привет, меня зовут", name, "мой возраст:", age, "лет")
