"""
Создайте переменные a и b и присвойте им значения 7 и 3.5 соответственно.
Выполните следующие арифметические операции и выведите результат:
Сложение a и b.
Разность a и b.
Произведение a на b.
Частное a на b.
"""

a = 7
b = 3.5

result_sum = a + b  # Сложение
result_diff = a - b  # Вычитание
result_prod = a * b  # Умножение
result_div = a / b  # Деление

print("Сложение:", result_sum)
print("Вычитание:", result_diff)
print("Умножение:", result_prod)
print("Деление:", result_div)
