"""
Цикл For:

Создайте список чисел от 1 до 5.
Используя цикл for, выведите кубы чисел в этом списке (1, 8, 27, 64, 125).
"""
my_list = [1, 2, 3, 4, 5]
for i in my_list:
    cub = i ** 3
    print("Куб числа:", i, "равен", cub)


